In [1]:
import pandas as pd

In [2]:
pd.set_option("display.max_rows", 1000)

In [3]:
data_1 = pd.read_csv("Noun Verb Pair Data/untagged_test_data_noun_verb_pair.csv")

In [4]:
data_1.head()

   Step#         word  pos
0    0.0      Combine   VB
1    0.0          all   DT
2    0.0  ingredients  NNS
3    0.0           in   IN
4    0.0        large   JJ

In [5]:
data_1.tail()

      Step#   word  pos
3359  243.0     an   DT
3360  243.0   hour   NN
3361  243.0     at   IN
3362  243.0  least  JJS
3363  243.0      .    .

In [6]:
data_1["Step#"] +=264

In [7]:
data_1 = data_1.rename(columns={"Step#":"sentence#"})

In [8]:
data_1.head()

   sentence#         word  pos
0      264.0      Combine   VB
1      264.0          all   DT
2      264.0  ingredients  NNS
3      264.0           in   IN
4      264.0        large   JJ

In [9]:
data_1.tail()

      sentence#   word  pos
3359      507.0     an   DT
3360      507.0   hour   NN
3361      507.0     at   IN
3362      507.0  least  JJS
3363      507.0      .    .

In [10]:
data_2 = pd.read_csv("../1 Scraping Data and Annotating Data/tagged_data.csv", index_col=0)

In [11]:
data_2.head()

   sentence#     word  pos        tag
0        0.0  Preheat   VB   U-Action
1        0.0     oven   NN  U-Utensil
2        0.0       to   IN          O
3        0.0      425   CD          O
4        0.0  degrees  NNS          O

In [12]:
len(set(data_2["sentence#"]))

264

In [13]:
data_2.tail()

      sentence#    word pos       tag
3440      262.0       .   .         O
3441      263.0  Freeze  VB  U-Action
3442      263.0     and  CC         O
3443      263.0   enjoy  VB         O
3444      263.0       !   .         O

In [14]:
market_basket = data_2.append(data_1)

In [15]:
market_basket.reset_index(inplace=True, drop=True)

In [16]:
market_basket.to_csv("./Noun Verb Pair Data/noun_verb_processed_data.csv", index=False)